src/src/Documents/PayrollSheet.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>PayrollSheet</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RegistrationPeriod</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OperationKind</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OperationTypesPayrollSheet</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StructuralUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SettlementsCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Multiplicity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Employees</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Employee</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Employees</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SettlementsAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PaymentAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/src/AccumulationRegisters/Payroll.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>Payroll</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AmountCur</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ContentOfAccountingRecord</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>StructuralUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Employee</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>RegistrationPeriod</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/src/InformationRegisters/Employees.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>Employees</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>StructuralUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Position</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Positions</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>OccupiedRates</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WorkSchedule</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.WorkSchedules</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Employee</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/src/Enums/OperationTypesPayrollSheet.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>OperationTypesPayrollSheet</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Advance</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Salary</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Documents/PayrollSheet/Ext/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventsHandlers

// Procedure - event handler BeforeWrite object.
//
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	
	If DataExchange.Load Then
		Return;
	EndIf;

	DocumentAmount = Employees.Total("PaymentAmount");
	
EndProcedure

#EndRegion

#Region ProgramInterface

// Procedure fills tabular section Employees balance by charges.
//
Procedure FillByBalanceAtServer() Export
	
	If OperationKind = Enums.OperationTypesPayrollSheet.Salary Then
	
		Query = New Query;
		Query.Text = "SELECT
		               |	PayrollBalance.Employee,
		               |	SUM(CASE
		               |			WHEN &SettlementsCurrency = &DocumentCurrency
		               |				THEN PayrollBalance.AmountCurBalance
		               |			ELSE CAST(PayrollBalance.AmountCurBalance * &ExchangeRate / &Multiplicity AS NUMBER(15, 2))
		               |		END) AS PaymentAmount,
		               |	SUM(PayrollBalance.AmountCurBalance) AS SettlementsAmount
		               |FROM
		               |	AccumulationRegister.Payroll.Balance(,
		               |			Company = &Company
		               |				AND RegistrationPeriod = &RegistrationPeriod
		               |				AND Currency = &SettlementsCurrency
		               |				AND StructuralUnit = &StructuralUnit) AS PayrollBalance
		               |WHERE
		               |	PayrollBalance.AmountCurBalance > 0
		               |
		               |GROUP BY
		               |	PayrollBalance.Employee
		               |
		               |ORDER BY
		               |	PayrollBalance.Employee.Description";
		
		Query.SetParameter("RegistrationPeriod", 	RegistrationPeriod);
		Query.SetParameter("Company", 		DriveServer.GetCompany(Company));
		Query.SetParameter("StructuralUnit", StructuralUnit);
		Query.SetParameter("SettlementsCurrency",		SettlementsCurrency);
		Query.SetParameter("DocumentCurrency",	DocumentCurrency);
		Query.SetParameter("ExchangeRate",				ExchangeRate);
		Query.SetParameter("Multiplicity",			Multiplicity);
		
		Employees.Load(Query.Execute().Unload());

	ElsIf OperationKind = Enums.OperationTypesPayrollSheet.Advance Then	
		
		Message = New UserMessage();
		Message.Text = NStr("en = 'If advance is paid, population according to balance is not provided.'");
 		Message.Message();
		
	EndIf;
	
EndProcedure

// Procedure fills tabular section Employees by department.
//
Procedure FillByDepartmentAtServer() Export
		
	Query = New Query;
	Query.Text = "SELECT DISTINCT
	               |	EmployeesDeparnments.Employee AS Employee,
	               |	EmployeesDeparnments.StructuralUnit AS StructuralUnit
	               |FROM
	               |	(SELECT
	               |		EmployeesSliceLast.Employee AS Employee,
	               |		EmployeesSliceLast.StructuralUnit AS StructuralUnit
	               |	FROM
	               |		InformationRegister.Employees.SliceLast(
	               |				&RegistrationPeriod,
	               |				Company = &Company
	               |					AND (StructuralUnit = &StructuralUnit
	               |						OR StructuralUnit = VALUE(Catalog.BusinessUnits.EmptyRef))) AS EmployeesSliceLast
	               |	
	               |	UNION ALL
	               |	
	               |	SELECT
	               |		Employees.Employee,
	               |		Employees.StructuralUnit
	               |	FROM
	               |		InformationRegister.Employees AS Employees
	               |	WHERE
	               |		Employees.Company = &Company
	               |		AND Employees.StructuralUnit = &StructuralUnit
	               |		AND Employees.Period between &RegistrationPeriod AND ENDOFPERIOD(&RegistrationPeriod, MONTH)) AS EmployeesDeparnments
	               |WHERE
	               |	EmployeesDeparnments.StructuralUnit <> VALUE(Catalog.BusinessUnits.EmptyRef)
	               |
	               |GROUP BY
	               |	EmployeesDeparnments.Employee,
	               |	EmployeesDeparnments.StructuralUnit
	               |
	               |ORDER BY
	               |	Employee";
	
	Query.SetParameter("RegistrationPeriod", 		RegistrationPeriod);
	Query.SetParameter("StructuralUnit",		StructuralUnit);
	Query.SetParameter("Company", 			DriveServer.GetCompany(Company));
	
	Employees.Load(Query.Execute().Unload());
	
EndProcedure

#EndRegion

#EndIf
